-- Query 1: 
Select *
From "Поставщики" p1
Where p1."Идентификатор" not in (select "Поставки"."Поставщик" from "Поставки")

-- Query 2:
Select *
From "Поставщики" p1
Where p1."Идентификатор" in (select "Поставки"."Поставщик" from "Поставки")
order by p1."Поставщик" asc;

-- Query 3:
select * from "Товары" 
where 
(select "Дата поставки" from "Поставки" where "Товары"."Артикул товара" = "Поставки"."Артикул товара") +
(select "Срок реализации, дней" from "Категории товара" where "Товары"."Категория товара" = "Категории товара"."Название") <= current_date
order by "Товары"."Название товара" 

-- Query 4:
select "Артикул товара", 
sum("Количество товара") * (select "Вес единицы товара" from "Товары" where "Товары"."Артикул товара" = "Поставки"."Артикул товара") as sm,
(select "Единица измерения" from "Товары" where "Товары"."Артикул товара" = "Поставки"."Артикул товара")
from "Поставки" 
group by "Артикул товара"
order by sm desc

-- Query 5:
select * from "Товары" 
where "Товары"."Минимум запаса в магазине" > (select sum("Остаток товара") from "Поставки" where "Поставки"."Артикул товара" = "Товары"."Артикул товара")
order by "Товары"."Минимум запаса в магазине" - (select sum("Остаток товара") from "Поставки" where "Поставки"."Артикул товара" = "Товары"."Артикул товара")
