-- view 1:
create view "Товары, поставленные в течение последних трех дней, остаток которых меньше 10% от первоначального количества" as 
select "Название товара" from "Поставки" as p join "Товары" as t on p."Артикул товара" = t."Артикул товара" 
where current_date - p."Дата поставки" <= 3 and p."Количество товара" * 0.1 > p."Остаток товара"

-- view 2:
create view "Общая стоимость остатков товаров" as select t."Категория товара", "Название товара", sum(p."Цена единицы товара" * p."Остаток товара")  as "Общая стоимость" 
from  "Поставки" as p join "Товары" as t on p."Артикул товара" = t."Артикул товара" 
group by t."Название товара", t."Категория товара"

-- view 3:
create view "Остатки товаров" as
select t."Название товара", sum(p."Остаток товара") as "Общий остаток", sum(
(select "Остаток товара" where current_date - p."Дата поставки" > (select "Срок реализации, дней" from "Категории товара" as kat where t."Категория товара" = kat."Название")) 
) as "Остаток с истекшим сроком",
sum(
(select "Остаток товара" where current_date - p."Дата поставки" <= (select "Срок реализации, дней" from "Категории товара" as kat where t."Категория товара" = kat."Название")) 
) as "Остаток с неистекшим сроком"
from "Поставки" as p join "Товары" as t on p."Артикул товара" = t."Артикул товара" 
group by t."Название товара"
